Музей_искусств/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <attributes>
    <name>ИтоговаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Билеты</name>
    <attributes>
      <name>Билет</name>
      <type>
        <types>CatalogRef.Билеты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипБилета</name>
      <type>
        <types>EnumRef.ТипБилета</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Музей_искусств/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Билет</name>
    <type>
      <types>CatalogRef.Билеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Музей_искусств/src/Enums/ТипБилета/ТипБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипБилета</name>
  <enumValues>
    <name>Детский</name>
  </enumValues>
  <enumValues>
    <name>Полный</name>
  </enumValues>
  <enumValues>
    <name>Льготный</name>
  </enumValues>
</mdclass:Enum>

Музей_искусств/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура БилетыБилетПриИзмененииНаСервере(Билет, ТипБилета, ИндексСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  	"ВЫБРАТЬ
		|	Цены.Цена
		|ИЗ
		|   РегистрСведений.Цены КАК Цены
		|ГДЕ
		|	Цены.Билет = &Значение";
	Запрос.УстановитьПараметр("Значение", Билет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	ЦенаПолногоБилета = 0;
	Пока РезультатЗапроса.Следующий()Цикл
		Цена = РезультатЗапроса.Цена;
	КонецЦикла;
	Если (ТипБилета = Перечисления.ТипБилета.Полный) Тогда 
		Объект.Билеты[ИндексСтроки].Цена = Цена;
	Иначе; 
		Если (ТипБилета = Перечисления.ТипБилета.Детский) Тогда
			Объект.Билеты[ИндексСтроки].Цена = Цена*0.7;
		Иначе
			Объект.Билеты[ИндексСтроки].Цена = Цена*0.6;
	   	КонецЕсли;
	КонецЕсли;
	
	ИтоговаяЦена = 0;
	Для Каждого СтрокаТаблицы из Объект.Билеты Цикл
		Если ЗначениеЗаполнено(Цена) Тогда
			ИтоговаяЦена = ИтоговаяЦена + СтрокаТаблицы.Цена;	
		КонецЕсли;	
	КонецЦикла;	
	Объект.ИтоговаяЦена = ИтоговаяЦена;
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыБилетПриИзменении(Элемент)
	Таблица = Объект.Билеты;
	Для Каждого СтрокаТаблицы из Таблица Цикл
		Билет = СтрокаТаблицы.Билет;
		ТипБилета = СтрокаТаблицы.ТипБилета;
		Если (ЗначениеЗаполнено(Билет) И ЗначениеЗаполнено(ТипБилета)) Тогда			 
			 ИндексСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
			 БилетыБилетПриИзмененииНаСервере(Билет,ТипБилета, ИндексСтроки);			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура БилетыТипБилетаПриИзменении(Элемент)
	Таблица = Объект.Билеты;
	Для Каждого СтрокаТаблицы из Таблица Цикл
		Билет = СтрокаТаблицы.Билет;
		ТипБилета = СтрокаТаблицы.ТипБилета;
		Если (ЗначениеЗаполнено(Билет) И ЗначениеЗаполнено(ТипБилета)) Тогда			 
			 ИндексСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
			 БилетыБилетПриИзмененииНаСервере(Билет,ТипБилета, ИндексСтроки);			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
